# MySQL Exercise

<hr>

## Import Library

In [ ]:
import mysql.connector
import pandas as pd

## Buat Koneksi Ke Database

In [ ]:
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    passwd = '12345',
    database = 'sakila')

## Fungsi Query

In [ ]:
kursor = mydb.cursor()
def buat_sql(query) :
    kursor.execute(query)
    hasil = kursor.fetchall()
    data = pd.DataFrame(data = hasil, columns = kursor.column_names)
    return data

<hr>

### Soal 1

1. Gunakan database “Sakila”
1. Tampilkan 10 baris data customer id, rental id, amount, dan payment date pada table payment.

In [ ]:
buat_sql(
    '''
    SELECT customer_id, rental_id, amount, payment_date
    FROM payment
    LIMIT 10;
    '''
)

   customer_id  rental_id amount        payment_date
0            1         76   2.99 2005-05-25 11:30:37
1            1        573   0.99 2005-05-28 10:35:23
2            1       1185   5.99 2005-06-15 00:54:12
3            1       1422   0.99 2005-06-15 18:02:53
4            1       1476   9.99 2005-06-15 21:08:46
5            1       1725   4.99 2005-06-16 15:18:57
6            1       2308   4.99 2005-06-18 08:41:48
7            1       2363   0.99 2005-06-18 13:33:59
8            1       3284   3.99 2005-06-21 06:24:45
9            1       4526   5.99 2005-07-08 03:17:05

<hr>

### Soal 2

1. Gunakan database “Sakila”
1. Dari table “film”, tampilkan 10 judul film, tahun release, dan durasi rental dimana judul film yang ditampilkan yang dimulai dengan huruf “S”

In [ ]:
buat_sql(
    '''
    SELECT title, release_year, rental_duration
    FROM film
    WHERE title LIKE 's%'
    LIMIT 10;
    '''
)

                       title  release_year  rental_duration
0           SABRINA MIDNIGHT          2006                5
1           SADDLE ANTITRUST          2006                7
2         SAGEBRUSH CLUELESS          2006                4
3               SAINTS BRIDE          2006                5
4              SALUTE APOLLO          2006                4
5               SAMURAI LION          2006                5
6                SANTA PARIS          2006                7
7               SASSY PACKER          2006                6
8  SATISFACTION CONFIDENTIAL          2006                3
9             SATURDAY LAMBS          2006                3

<hr>

### Soal 3

1. Gunakan database “Sakila”
1. Tampilkan field durasi rental, banyaknya film dalam setiap durasi rental, dan rata-rata durasi film dari table “film”. Kelompokkan semuanya berdasarkan durasi rentalnya
1. Karena rata-rata durasi film menghasilkan angka desimal, bulatkan hingga hanya 2 angka di belakang koma saja.

In [ ]:
buat_sql(
    '''
    SELECT rental_duration as Durasi_Rental,
    COUNT(film_id) as Banyak_Film,
    ROUND(AVG(length), 2) as Rata_rata_Durasi_Film
    FROM film
    GROUP BY rental_duration
    ORDER BY rental_duration
    ''')

   Durasi_Rental  Banyak_Film Rata_rata_Durasi_Film
0              3          203                112.91
1              4          203                111.23
2              5          191                116.56
3              6          212                117.04
4              7          191                118.83

<hr>

### Soal 4

1. Gunakan database “Sakila”
1. Dari table film, tampilkan title, durasi film, dan juga rating yang durasi filmnya lebih dari rata-rata durasi film total. 
1. Tampilkan 25 data yang diurutkan dari durasi terlama

In [ ]:
buat_sql(
    '''
    SELECT title, length, rating
    FROM film
    WHERE length >
    (SELECT AVG(length) FROM film)
    ORDER BY length
    LIMIT 25
    '''
)

                     title  length rating
0         INSTINCT AIRPORT     116     PG
1           MADIGAN DORADO     116      R
2               DUCK RACER     116  NC-17
3             WORDS HUNTER     116     PG
4         AFFAIR PREJUDICE     117      G
5            GRAFFITI LOVE     117     PG
6           MAGIC MALLRATS     117     PG
7          CHAMBER ITALIAN     117  NC-17
8   RESURRECTION SILVERADO     117     PG
9            ORIENT CLOSER     118      R
10           PATHS CONTROL     118     PG
11     JAWBREAKER BROOKLYN     118     PG
12             OTHERS SOUP     118     PG
13     BACKLASH UNDEFEATED     118  PG-13
14       PERSONAL LADYBUGS     118  PG-13
15             ROUGE SQUAD     118  NC-17
16          FIDELITY DEVIL     118      G
17              DUMBO LUST     119  NC-17
18      STRANGERS GRAFFITI     119      R
19          IDENTITY LOVER     119  PG-13
20    APOCALYPSE FLAMINGOS     119      R
21              BUGSY SONG     119      G
22         GAMES BOWFINGER     119  PG-13
23              DOLLS RAGE     120  PG-13
24       CALENDAR GUNFIGHT     120  NC-17

<hr>

### Soal 5

1. Gunakan database “Sakila”
1. Tampilkan rating, Replacement Cost tertinggi dari setiap kelompok rating, Rental Rate Terendah dari setiap kelompok rating, dan Rata-Rata Durasi dari setiap kelompok rating dari table film.

In [ ]:
buat_sql(
    '''
    SELECT rating as Rating,
    MAX(replacement_cost) as Replacement_Cost_Tertinggi,
    MAX(rental_rate) as Rental_Rate_Terendah,
    AVG(length) as Rata_rata_Durasi
    FROM film
    GROUP BY rating
    '''
)

  Rating Replacement_Cost_Tertinggi Rental_Rate_Terendah Rata_rata_Durasi
0     PG                      29.99                 4.99         112.0052
1      G                      29.99                 4.99         111.0506
2  NC-17                      29.99                 4.99         113.2286
3  PG-13                      29.99                 4.99         120.4439
4      R                      29.99                 4.99         118.6615

<hr>

### Soal 6

1. Gunakan database “Sakila”
1. Tampilkan 15 daftar film yang memiliki huruf “K” pada akhir pada title. Tampilkan title, durasi, serta Bahasa pada film.
1. Sebagai catatan, lakukan join terlebih dahulu dari table “film” dan juga table “language”.

In [ ]:
buat_sql(
    '''
    SELECT film.title as Judul,
    film.length as Durasi,
    language.name as Bahasa_Film
    FROM film INNER JOIN language
    ON film.language_id = language.language_id
    WHERE film.title LIKE '%k'
    LIMIT 15;
    '''
)

                Judul  Durasi Bahasa_Film
0     AIRPORT POLLOCK      54     English
1     BEAST HUNCHBACK      89     English
2      BULL SHAWSHANK     125     English
3        CANYON STOCK      85     English
4          CHILL LUCK     142     English
5         CHITTY LOCK     107     English
6      CHOCOLATE DUCK     132     English
7       CITIZEN SHREK     165     English
8     CROWDS TELEMARK     112     English
9          DAZED PUNK     120     English
10   DESTINATION JERK      76     English
11      FANTASIA PARK     131     English
12        FLYING HOOK      69     English
13     GRIT CLOCKWORK     137     English
14  HANDICAP BOONDOCK     108     English

<hr>

### Soal 7

1. Gunakan database “Sakila”
1. Tampilkan Judul Film (Dari table “film”), First Name (Dari table “actor”), dan Last Name (Dari table “actor”) dari actor yang memiliki “actor_id” = 14
1. Sebagai catatan, lakukan join table terlebih dahulu antara table “film”, “film_actor”, dan table “actor”.

In [ ]:
buat_sql(
    '''
    SELECT film.title,
    actor.first_name,
    actor.last_name
    FROM film_actor 
    JOIN film 
    ON film_actor.film_id = film.film_id
    JOIN actor 
    ON actor.actor_id = film_actor.actor_id
    WHERE film_actor.actor_id = 14;
    '''
)

                   title first_name last_name
0           CLASH FREDDY     VIVIEN    BERGEN
1       CRANES RESERVOIR     VIVIEN    BERGEN
2              DIRTY ACE     VIVIEN    BERGEN
3           DONNIE ALLEY     VIVIEN    BERGEN
4   DRIFTER COMMANDMENTS     VIVIEN    BERGEN
5         DRIVING POLISH     VIVIEN    BERGEN
6         DRUMS DYNAMITE     VIVIEN    BERGEN
7             ENEMY ODDS     VIVIEN    BERGEN
8         EXCITEMENT EVE     VIVIEN    BERGEN
9         GORGEOUS BINGO     VIVIEN    BERGEN
10           HIGH ENCINO     VIVIEN    BERGEN
11       HILLS NEIGHBORS     VIVIEN    BERGEN
12          HOBBIT ALIEN     VIVIEN    BERGEN
13        IMPACT ALADDIN     VIVIEN    BERGEN
14       ITALIAN AFRICAN     VIVIEN    BERGEN
15          JAPANESE RUN     VIVIEN    BERGEN
16      KENTUCKIAN GIANT     VIVIEN    BERGEN
17         LOVELY JINGLE     VIVIEN    BERGEN
18          LOVER TRUMAN     VIVIEN    BERGEN
19    MUSSOLINI SPOILERS     VIVIEN    BERGEN
20       POLISH BROOKLYN     VIVIEN    BERGEN
21         SALUTE APOLLO     VIVIEN    BERGEN
22        SATURDAY LAMBS     VIVIEN    BERGEN
23           STOCK GLASS     VIVIEN    BERGEN
24  STREETCAR INTENTIONS     VIVIEN    BERGEN
25           TIGHTS DAWN     VIVIEN    BERGEN
26             TRAP GUYS     VIVIEN    BERGEN
27      TYCOON GATHERING     VIVIEN    BERGEN
28           VOICE PEACH     VIVIEN    BERGEN
29   WESTWARD SEABISCUIT     VIVIEN    BERGEN

<hr>

### Soal 8

1. Gunakan database “Sakila”
1. Tampilkan city dan country id pada tabel "city" yang memili huruf "d" pada nama kotanya, serta diakhiri dengan huruf a
1. Tampilkan 15 data yang diurutkan berdasarkan citynya

In [ ]:
buat_sql(
    '''
    SELECT city, country_id
    FROM city
    WHERE city like '%d%' and city like '%a'
    ORDER BY city
    LIMIT 15;
    '''
)

                   city  country_id
0                 Adana          97
1           Addis Abeba          31
2           Alessandria          49
3              Alvorada          15
4   Aparecida de Goinia          15
5            Avellaneda           6
6               Bamenda          19
7                Crdoba           6
8                 Dhaka          12
9           Guadalajara          60
10               Haldia          44
11              Hodeida         107
12                Jedda          82
13         Juiz de Fora          15
14               Kaduna          69

<hr>

### Nomor 9

1. Gunakan database “sakila”
1. Tampilkan nama genre (name) dari table “category” dan jumlah banyaknya film di setiap genrenya.
1. Lakukan join terlebih dahulu antara table “film”, “film_category”, dan “category”
1. Urutkan berdasarkan jumlah film di setiap kategorinya.

In [ ]:
buat_sql(
    '''
    SELECT category.name as Genre,
    COUNT(film.title) as Banyak_Film
    FROM film
    LEFT JOIN film_category 
    ON film.film_id = film_category.film_id
    LEFT JOIN category 
    ON film_category.category_id = category.category_id
    GROUP BY category.name
    ORDER BY Banyak_Film;
    '''
)

          Genre  Banyak_Film
0         Music           51
1        Horror           56
2      Classics           57
3        Travel           57
4        Comedy           58
5      Children           60
6        Sci-Fi           61
7         Games           61
8         Drama           62
9           New           63
10       Action           64
11    Animation           66
12  Documentary           68
13       Family           69
14      Foreign           73
15       Sports           74

<hr>

### Nomor 10

1. Gunakan database “Sakila”
1. Tampilkan title, description, length, serta rating dari table “film”. 
1. Tampilkan 10 judul yang memiliki judul dengan akhiran ‘h’ dan memiliki durasi lebih dari durasi rata-rata.
1. Urutkan berdasarkan judul nya.

In [ ]:
buat_sql(
    '''
    SELECT title, description, length, rating
    FROM film
    WHERE title like '%h' AND
    length > (SELECT AVG(length) FROM film)
    ORDER BY title
    LIMIT 10;
    '''
)

,title,description,length,rating
0,CHICAGO NORTH,A Fateful Yarn of a Mad Cow And a Waitress who...,185,PG-13
1,DADDY PITTSBURGH,A Epic Story of a A Shark And a Student who mu...,161,G
2,DOUBLE WRATH,A Thoughtful Yarn of a Womanizer And a Dog who...,177,R
3,DOUBTFIRE LABYRINTH,A Intrepid Panorama of a Butler And a Composer...,154,R
4,DRIVING POLISH,A Action-Packed Yarn of a Feminist And a Techn...,175,NC-17
5,EMPIRE MALKOVICH,A Amazing Story of a Feminist And a Cat who mu...,177,G
6,GREASE YOUTH,A Emotional Panorama of a Secret Agent And a W...,135,G
7,HAROLD FRENCH,A Stunning Saga of a Sumo Wrestler And a Stude...,168,NC-17
8,HOMICIDE PEACH,A Astounding Documentary of a Hunter And a Boy...,141,PG-13
9,JADE BUNCH,A Insightful Panorama of a Squirrel And a Mad ...,174,NC-17

<hr>

# **``Thank you``**